package ru.stimmax.lessons.lesson07.homework_07



fun main() {


//Прямой Диапазон.
//Напишите функцию, которая печатает числа от 1 до 10.
    //for (i in 1..10) {
    //    println(i)
   // }
//Напишите функцию, которая выводит на экран квадраты чисел от 1 до 5.
   // for (i in 1..5) {
    //    println(i*i)
    //}
//Обратный Диапазон.
//Создайте функцию, которая выводит все числа от 10 до 1 в обратном порядке.
    //for (i in 10 downTo 1) {
     //   println(i)
    //}
//Напишите программу, которая отображает убывающую последовательность четных
//чисел от 20 до 2.
   // for (i in 20 downTo 2) {
    //    if (i % 2 == 0) {
    //        println(i)
     //   }
    //}


//Цикл с Шагом.
//Реализуйте функцию, выводящую каждое третье число в диапазоне от 1 до 30.
    //for (i in 1..30) {
       // if (i%3==0) {
        //    println(i)
      //  }
   // }
//Напишите цикл, который печатает числа от 100 до 50 с шагом 5.
  //  for (i in 100 downTo 50 step 5) {
   //     println(i)
   // }


//Использование until.
//Создайте целочисленную переменную длины списка 'length'.
// Создайте цикл, который выводит индексы элементов списка.
    // Индексы начинаются с нуля.
    val length: Int = 10
    for (i in 0 until length) {
             println(i)
         }


//Задачи для цикла while
//Цикл While.
//Напишите функцию, которая суммирует числа от 1 до 10, используя цикл while.


//Создайте цикл, который считает количество цифр в числе, начиная с 100
// и уменьшая его на 1 после каждой итерации.


//Цикл do while
//Напишите программу, которая начинает суммирование чисел, начиная с 1,
// и продолжает добавлять следующее число (2, 3, 4, ...),
// пока сумма не превысит 50.

//Найти наибольшее целое число, факториал которого меньше или равен 1000.


//Задачи с прерыванием и пропуском итерации
//Использование break.
//Напишите цикл, перебирающий числа от 1 и прерывающийся, как только
// встречается число, кратное 7.

//Создайте цикл, который выводит числа от , но прерывается при достижении числа 25.


//Использование continue.
//Реализуйте цикл, который печатает все числа от 1 до 10, кроме чисел 3 и 7.

//Напишите цикл, перебирающий числа от 20 до 1, но пропускающий
// каждое четвертое число.

}